app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at", "picture") VALUES (?, ?, ?, ?, ?)  [["content", "asd"], ["user_id", 6], ["created_at", "2017-08-11 09:09:26.189546"], ["updated_at", "2017-08-11 09:09:26.189546"], ["picture", "setting.png"]]
---
  def create
    @micropost = current_user.microposts.build(micropost_params)
    if @micropost.save