app/controllers/password_resets_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", ""], ["LIMIT", 1]]
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest", "activation_digest", "activated", "activated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.find_by email: params[:password_reset][:email].downcase
    if @user
      @user.create_reset_digest

UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$04$wwYBm8YtLRKPYgkgUcrRHOZcq4q7hhzcAunLIvbuDwqN1kkRF3p5C"], ["updated_at", "2017-08-10 09:15:07.840753"], ["id", 762146111]]
---
  def update
    if params[:user][:password].empty?
      @user.errors.add(:password, t("empty"))
      render :edit
    elsif @user.update_attributes(user_params)

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "michael@example.com"], ["LIMIT", 1]]
---
  def load_user
    @user = User.find_by email: params[:email]